Tekla Open API Reference for Tekla Structures 2025
RebarStrand.Unbondings Property
 An array list of StrandUnbondingData items.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Unbondings { get; set; }
Public Property Unbondings As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace